[
  {
    "summary_theme": "advanced persistent threats",
    "data_type": "text",
    "content": "Information from APTs should be included as examples of commonly known TTPs. All runs should include at a minimum TTPs from known groups. If specific APTs are known, or suspected, to be targeting the system under evaluation, the TTPs should be considered more strongly, and the defensive measures that would be likely to prevent these APTs from gaining access should be scored more heavily both in terms of points for or against the algorithm. The suspected APTs that should be considered are: NONE."
  },
  {
    "summary_theme": "company",
    "data_type": "text",
    "content": "A small business company named 'Working Software as a Service' (WSAAS) that develops, delivers, maintains software deployments for their customers. WSAAS customers are extremely satisfied with the products, and they have become key components within the critical missions for these customer organizations. This requires WSAAS to maintain certain critical functions for internal operations at all times in order to meet the customer's needs. The WSAAS facility layout consists of discrete spaces for the work areas: Software Development, Quality Assurance, Information Technology and Cybersecurity, and Company Management. The facility also has a Main Lobby area for visitors and during normal business hours there is a Security Guard to control visitor access to the facility. There may be some problems with the facility layout that could impact the company's cyber resiliency in the event of an outsider threat or insider threat event. Competitor companies and foreign governments very much want access to WSAAS's products design artifacts and test data as well as the unique Intellectual Property (IP) information that the company has created."
  },
  {
    "summary_theme": "Information System Cyber Vulnerabilities Lists",
    "data_type": "text",
    "content": "Tables list the vulnerabilities that are present on the company information system under evaluation. For the purpose of this evaluation, assume that all computer Ports, Protocols, and Services (PPS) needed to exploit each listed vulnerability are enabled on the endpoint and network devices. The Common Vulnerability and Exposure (CVE) numbers provided in the table are reference numbers for a given vulnerability used on the MITRE CVE website. The National Institute of Standards and Technology (NIST) has a National Vulnerability Database (NVD) that includes the CVEs, and they assign a Common Vulnerability Scoring System (CVSS) score to each vulnerability to recommend a severity rating if the vulnerability were successfully exploited. The NVD also provides a CVSS Calculator to allow cybersecurity engineers to adjust the default NVD CVSS score for a given vulnerability if it is deemed appropriate. Some of the NVD CVSS scores use the Version 2 calculator while others use the Version 3.x calculator, so when both CVSS scores are provide for a given vulnerability the Version 3.x calculator value should be used for this evaluation."
  },
  {
    "summary_theme": "operational policies",
    "data_type": "text",
    "content": "Some additional company facility and information system characteristics to consider are: This has resulted in the IT staff performing vulnerability scans on the system in compliance with company policy but are not detecting the new vulnerabilities on the information system. The IT staff has implemented user accounts processes and monitoring procedures and have implemented Role Based Access Control (RBAC) with four defined roles: System Administrator (SA) - The SA role has 'root' level privileges to all IT equipment, cybersecurity capability and tools, and all data stored on the workstations and laptops, servers, and SANS storage locations to include the Archive and Archive Backup locations. IT staff is assigned the SA role, and the IT staff is responsible for performing all cybersecurity tasks and data management tasks. Software Developer (Dev) - The Dev role has 'owner' privileges to all software applications and tools used during product and system development, configuration management, integration, production, fielding, and sustainment. This role also has access to all the engineering and production data for all the company projects. All the company software developer staff are assigned the Dev role. Quality Assurance (QA) The QA role has 'owner' privileges to all the software applications used to test the company products during development and integration as well as the production units. The QA role also has 'owner' privileges to all test plans, test procedures, product under test configuration information, and test data. All company Quality Assurance staff are assigned the TE role. Company Management (CMgmt) - The CMgmt role has 'owner' privileges to all the company sensitive information to include Human Resources records, Payroll records, Project Management records, Legal records, and personnel managers records to include the company Vice President and President records. All company management staff are assigned the CMgmt role. The facility IT System Administrator will routinely monitor the SIEM for cybersecurity alerts and will initiate internal cybersecurity tests, such as Anti-Virus scans and Nessus vulnerability scans, of all installed IT in compliance with the company cybersecurity policy and procedures. The facility System Administrator will also perform user account management from the Boundary Defense and System Management rack through the IdM service. The System Administrator will validate all user accounts are still valid and that each user has the appropriate roles assigned at least monthly per the company cybersecurity policy and procedures."
  },
  {
    "summary_theme": "personnel training",
    "data_type": "text",
    "content": "Some additional company facility and information system characteristics to consider are: -There is one IT staff member. They have years of IT and cybersecurity experience, formal technical education, and a number of IT and cybersecurity certifications. They were hired into the company within the past 6 months to improve the information system security, but the system architecture is already deployed and there is no funding to make improvements until next year."
  },
  {
    "summary_theme": "physical security",
    "data_type": "text",
    "content": "Some additional company facility and information system characteristics to consider are: -Company facility is in a shared building in a busy city district with lots of foot traffic. -Company facility implements some physical security measures to include a Security Guard desk at the main entrance that is staffed Monday-Friday 8:00 AM to 5:00 PM. The main entrance is locked when the Guard is not on duty but allows employees to exit if they work late (sometimes the door does not close all the way if employees do not make sure it catches). An after-hours alarm system that only monitors the main entrance door is implemented and it is monitored by a commercial service over a telephone line link. All employees know the alarm code in the event they need to work late or have to come into work over the weekend. The last employee leaving the facility in the evening is responsible for activating the alarm. -Company has an equipment room that contains all the Information Technology (IT) equipment racks, and the room has a single door with an August Smart Lock Pro. The IT staff have their phones configured to control the lock and the door is usually left unlocked during normal business hours, but it is supposed to be locked whenever there is no IT staff present in the room per the company policy. The IT staff does not always lock the door if they step out and 'expect' to be back in 15 minutes or less. The equipment racks in the space do not have locks and neither does the equipment spares cabinet. -Company has a room for the Software Development staff, and it has a single entrance door with an August Smart Lock Pro. All the staff have their phones configured to control the lock. The belief is that the Security Guard at the main entrance will control visitors and all the company staff is trusted. -Company has a room for Quality Assurance testing, and it has a single door, but it is accessed through the Software Development room. It also does not have a key lock or any other physical access control mechanism. -Company Management offices are comprised of a suite of rooms that are accessed from a single door. That door has a key lock to secure the office space after hours. The door is unlocked during normal business hours, but a PIN keypad is used to gain access. The individual offices in the management suite do not have locks on their doors."
  },
  {
    "summary_theme": "System Critical Functions and Mapping",
    "data_type": "array of text",
    "content": {
      "criticality ratings": "The company information system provides fifteen functions that the software development, quality assurance, IT and cybersecurity, and company management work areas use. The criticality levels that are used within this system are listed below. A table lists the company critical functions that is provided by the company's proprietary application software that is installed on the workstations, laptops, and servers. A given function may execute on a single endpoint node within the information system, or it may be distributed across multiple nodes. The computer network infrastructure components that interconnect all the nodes will also be critical for the distributed functions to the highest criticality value of the functions that rely on the network components. A table maps the software functions to the information system endpoint nodes that are required to execute those functions. A "1" in the matrix indicates that all or a portion of the function is executed on an endpoint. Once simple method for assessing the criticality of an endpoint node (hardware and software) using the matrix mapping is to apply the "highwater mark" technique. For a given node in the table, scan the row to find the "1" that is in the highest criticality column, and that would be considered the highwater mark. For example, the Server Rack, Server #4 executes functions F4, F8, and F9, and since F4 has a criticality value of "High" in the table, then the Server #4 criticality is also considered "High". Likewise, the Software Development (Workstation 4) executes functions F7 and F11, and since function F7 is assessed as Medium criticality in the table while function F11 is assessed as Low criticality, the criticality of Workstation 4 is Medium. There are ae other techniques that can be used, so participants are encouraged to use their preferred methods.",
      "high criticality": "The company must maintain all High criticality functions at all times to meeting vital product development, test, and delivery to customers and to maintain timely customer support for fielded products. There are also contractual and safety reasons for having to maintain all High criticality functions. No interruption in critical functions is acceptable during cyber attacks on the company information system from external threats or internal threats or during natural disasters. IT and cybersecurity services within the company information system are considered High criticality.",
      "medium criticality": "The company can accept partial or complete interruption of Medium criticality functions for no longer than 1 month before it will begin impacting operations. Product development, test, production, and fielding can still be completed but the process is slowed down and is more expensive when medium criticality functions are degraded or denied for an extended period of time. Work arounds are defined to continue company operations when Medium criticality functions are disrupted.",
      "low criticality": "The company can accept long term degradation or denial of Low criticality functions. It is considered a nuisance if Low criticality functions are not available, but it will not impact product development, test, production, and fielding in any way and will have minimum impact on company management."
    }
  },
  {
    "summary_theme": "systems",
    "data_type": "text",
    "content": "Information system boundary Firewall Intrusion Prevention System (IPS) rulesets are not up to date. -Some of the hardware and software components within the company information system have reached "end- of-life". This means that the component manufacturer no longer supports the hardware or software item, and as a result will not provide security patches to firmware or software for any newly discovered vulnerabilities. -Nodes within the company information system have not had the latest security patches installed leaving open vulnerabilities. Some vulnerabilities have been known for some time but cannot be patched since some of the application software providing critical functions will stop working. -Nessus vulnerability scanner has not been updated with the latest plugins, where a single plugin performs an automated test to detect the presence of a specific known vulnerability on a commercial hardware or software item. The following subsections describe the company information system details. The cyber resiliency assessment should also include physical security, personnel training and level of experience, operational policies and procedures, and other factors in additional to the information system technical details."
  },
  {
    "summary_theme": "system equipment",
    "data_type": "array of text",
    "content": {
      "equipment": "This array provides an architecture view for the company's information system that is under evaluation. Note that there may be architecture design flaws that could impact the company's cyber resilience. Information System Components Description. The array describe the information system equipment racks and the hardware and software installed in the racks that will be part of the system under evaluation. The company has developed a suite of proprietary application software for their software development, quality assurance, and company management work areas.",
      "Boundary Defense and System Administration Rack": "As illustrated in the tables, the company facility will have a Boundary Defense and System Administration Rack that will include a Cisco Firepower Firewall with an Intrusion Prevention System (IPS). All external network traffic passing into or out of the facility will be routed through the Firewall and rulesets will be developed to only permit the required data flows. The IPS will be updated periodically with the latest Cisco signatures in order to detect well known cyber attacks, and specific alert types and automated response actions will be configured on the IPS by the facility IT System Administrator for each signature category. The rack will include a Cisco Layer 3 Switch that will interconnect the internal rack components as well as provide the interface to the other equipment racks within the facility. External network traffic that successfully passes through the Firewall will then be routed through the Layer 3 Switch to the end node destination. The rack will include PowerEdge Servers with a dedicated server for the Virtualization Management, Cybersecurity Capability and Tools, and Computer and Network Audit Log Server functions. The Virtualization Management Server will have a bulk data Storage Area Network (SAN) location. A built-in monitor, keyboard, and track ball will be part of the equipment rack and will provide the location where the System Administrator will configure and monitor the IT internal to the facility, perform cybersecurity tasks, and manage the user accounts. It will also be the location where the Virtualization Management will be performed when virtual machines are instantiated on the Server Racks for the production and test activities. A patch panel will provide a central cable management point for all the internal equipment interconnection in the rack. It will also allow for easier reconfiguration of the rack interconnect if it becomes necessary. The rack will include an Uninterruptible Power Supply with a power conditioner that will provide emergency power backup in the event of a primary facility power interruption. The Virtualization Manager Server will host the team's Gitlab server for version control of the software they develop. It also hosts virtual machines accessible to the public internet to serve the developed software for their customers. WSAAS's website advertising their services and allowing customers to log into accounts to manage payment information is also hosted on the Virtualization Manager Server as website hosted via Microsoft Internet Information Services (IIS) on a Windows Server 2008 virtual machine. The customer account login is verified against a plaintext Microsoft SQL Server database hosted on the same virtual machine. Customer financial information is stored in the same database. That same Windows Server 2008 machine is also the domain controller for WSAAS's internal Active Directory identity management. The Cybersecurity Tools will consist of a Splunk Security Information and Event Manager (SIEM), McAfee Anti-Virus scanner, and Nessus vulnerability scanner to monitor the facility operations and ensure the information systems are secure.",
      "Server Rack": "The Server Rack is illustrated in the tables, and it provides the common computing resources for the entire company to include the software development, quality assurance, and company management work areas. The IT and cybersecurity work area separated and is implemented on a dedicated Boundary Defense and System Administration Rack (section 3.2.1). The Server Rack contains multiple PowerEdge R750 Servers and PowerVault Storage Area Network (SANS) servers and they will be used within the facility to: -Provide the product design, development, and test tools. -Process and display technical data library artifacts that describe the systems and products under development and test within the organization to include sensitive Intellectual Property (IP) information. -Product Help Desk Response Ticketing System application software and record database software. The software development work area will provide a Help Desk to respond to customer questions and comments. The Help Desk operators will access the Ticketing System from their workstations. -Virtualized product under development Test and Analysis Environment for software products. -Company training environment that will be used to develop workforce knowledge and skills. -Provide computer resources for company management functions (e.g., Human Resources, Payroll, Legal, Contracts, project managers, personnel managers, company vice president, and company president). The rack also includes Cisco Catalyst Ethernet Switches that will interconnect the servers and SANS storage servers and a Cisco Meraki Layer 3 network switch will connect the server rack to any other server racks if they are installed in the future (not currently used). A patch panel is provided to allow for easier reconfiguration of the rack interconnect if it becomes necessary. An Uninterruptible Power Supply (UPS) will be included within the Server Rack that will provide temporary emergency power when the primary facility power circuit is interrupted allowing for a graceful shutdown or until any backup emergency power source is engaged. The tables provide the hardware and software list, respectively, for the Server Rack.",
      "Wireless Network": "The company also has a wireless network that is being broadcast. The Quality Assurance laptops connect to this network for all their network access. The network utilizes WPA2 encryption to protect communications, but all the staff know the password and a piece of paper with the network information is taped to the wall in the Software Development work area.",
      "Workstations and Laptops": "The company implements the common workstation configuration depicted in the tables for the software development and company management work areas. The quality assurance work area uses the laptop configuration depicted in the tables. Laptops are used to allow for testing of the product from the Quality Assurance Lab table as well as in the field. The laptops will use a direct attached bulk storage tower when testing on the production floor or in the field. The collected test data will then be transferred onto the Quality Assurance SAN once the laptops are reconnected to the company information system. The company does not have any kind of asset control process for the hard drives used within the direct attached bulk storage tower. The tables provide the company workstation hardware and software configuration, respectively. The tables provide the test laptop hardware and software configuration, respectively."
    }
  }
]