{
  "None": "",
  "admin@338": "admin@338 is a China-based cyber threat group. It has previously used newsworthy events as lures to deliver malware and has primarily targeted organizations involved in financial, economic, and trade policy, typically using publicly available RATs such as PoisonIvy, as well as some non-public backdoors.",
  "Ajax Security Team": "Ajax Security Team is a group that has been active since at least 2010 and believed to be operating out of Iran. By 2014, the group transitioned from website defacement operations to malware-based cyber espionage campaigns targeting the US defense industrial base and Iranian users of anti-censorship technologies.",
  "Akira": "Akira is a ransomware variant and ransomware deployment entity active since at least March 2023. Akira uses compromised credentials to access single-factor external access mechanisms such as VPNs for initial access, then various publicly available tools and techniques for lateral movement.",
  "ALLANITE": "ALLANITE is a suspected Russian cyber espionage group, that has primarily targeted the electric utility sector within the US and UK. The group’s tactics are similar to Dragonfly, although ALLANITE's capabilities have not exhibited disruptive or destructive actions.",
  "Andariel": "Andariel is a North Korean state-sponsored threat group active since at least 2009, targeting South Korean government agencies, military organizations, and various domestic companies.",
  "Aoqin Dragon": "Aoqin Dragon is a suspected Chinese cyber espionage group that has been active since at least 2013, targeting government, education, and telecommunication organizations in Australia, Cambodia, Hong Kong, Singapore, and Vietnam.",
  "APT-C-23": "APT-C-23 is a threat group active since at least 2014, primarily targeting the Middle East, including Israeli military assets. The group has developed mobile spyware targeting Android and iOS devices since 2017.",
  "APT-C-36": "APT-C-36 is a suspected South America espionage group that has been active since at least 2018, primarily targeting Colombian government institutions and important corporations in the financial and petroleum sectors.",
  "APT1": "APT1 is a Chinese threat group attributed to Unit 61398 of the People’s Liberation Army. The group has engaged in extensive cyber espionage campaigns against a variety of sectors, especially aerospace, telecommunications, and financial sectors.",
  "APT10": "A Chinese-linked group targeting managed service providers and clients with spear-phishing and public-facing application exploits, deploying malware such as ChChes and Quasar RAT for intellectual property theft and long-term persistence.",
  "APT12": "APT12 is a Chinese cyber espionage group active since at least 2014, primarily targeting media outlets, high-tech companies, and various government entities.",
  "APT16": "APT16 is a Chinese threat group known for spearphishing campaigns targeting Japanese and Taiwanese organizations.",
  "APT17": "APT17 is a Chinese threat group known for its targeting of US government entities, defense industries, and legal firms, primarily utilizing network intrusions.",
  "APT18": "APT18 is a Chinese threat group that has operated since 2009 and targets industries such as technology, human rights organizations, and healthcare.",
  "APT19": "APT19 is a Chinese group targeting industries like defense, finance, energy, and legal services. The group is known for its phishing campaigns and potential overlap with the Deep Panda group.",
  "APT27": "A Chinese state-sponsored group targeting government and critical infrastructure, exploiting networking vulnerabilities with advanced lateral movement, deploying custom malware like HyperBro and PlugX for espionage.",
  "APT28": "APT28 is a Russian threat group linked to GRU military intelligence, known for spear-phishing campaigns targeting NATO, governments, and political institutions, with custom malware like X-Agent.",
  "APT29": "APT29 is a Russian group associated with the Foreign Intelligence Service (SVR). Known for targeting government and research organizations, APT29 uses advanced living-off-the-land techniques and custom malware like CloudDuke.",
  "APT3": "APT3 is a China-based group attributed to China’s Ministry of State Security. It is responsible for campaigns like Operation Clandestine Fox and targets industries like aerospace and defense.",
  "APT30": "APT30 is a Chinese cyber espionage group, often targeting government and political institutions in Southeast Asia, with a focus on intelligence collection.",
  "APT32": "APT32 is a Vietnamese state-sponsored cyber espionage group known for targeting private industries and government organizations across Southeast Asia.",
  "APT33": "APT33 is an Iranian group focused on targeting the aviation and energy sectors, particularly in the US, Saudi Arabia, and South Korea.",
  "APT34": "An Iranian group focusing on Middle Eastern organizations, utilizing spear-phishing and public-facing application exploits, deploying malware such as TRIGONA and HELMINTH for persistence via web shells.",
  "APT35": "An Iranian-linked group targeting government and defense sectors, using spear-phishing and social engineering, deploying custom malware like POWERSTATS and targeting nuclear and military entities.",
  "APT37": "APT37 is a North Korean cyber espionage group targeting South Korea and other regions, primarily focusing on government and defense entities.",
  "APT38": "APT38 is a North Korean group specialized in financially motivated attacks, known for targeting the SWIFT banking system, executing theft operations involving millions of dollars.",
  "APT39": "APT39 is an Iranian cyber espionage group, targeting telecommunications, travel, and other sectors to gather intelligence and personal data.",
  "APT40": "A Chinese group targeting maritime industries through spear-phishing and watering hole attacks, deploying custom malware like Derusbi and Gh0st RAT to maintain long-term persistence and exfiltrate sensitive data.",
  "APT41": "APT41 is a Chinese-linked espionage and financially motivated group, known for supply chain attacks and exploiting vulnerabilities in software development processes.",
  "Aquatic Panda": "Aquatic Panda is a China-based group focused on intelligence collection and industrial espionage, primarily targeting telecommunications and technology sectors.",
  "Axiom": "Axiom is a suspected Chinese cyber espionage group, targeting aerospace, defense, government, and manufacturing sectors.",
  "BackdoorDiplomacy": "BackdoorDiplomacy is a cyber espionage group targeting Ministries of Foreign Affairs and telecommunications companies in Africa, Europe, the Middle East, and Asia.",
  "BITTER": "BITTER is a South Asian cyber espionage group targeting government, energy, and engineering sectors in Pakistan, China, Bangladesh, and Saudi Arabia.",
  "BlackOasis": "BlackOasis is a Middle Eastern group targeting prominent individuals like opposition activists and journalists, often associated with Gamma Group customers.",
  "BlackTech": "BlackTech is a suspected Chinese cyber espionage group targeting organizations across East Asia, particularly those in media and electronics manufacturing sectors.",
  "Blue Mockingbird": "Blue Mockingbird is a cluster of activity involving Monero cryptocurrency-mining payloads, first observed in December 2019.",
  "BRONZE BUTLER": "BRONZE BUTLER is a Chinese cyber espionage group targeting Japanese organizations, particularly in government and biotechnology sectors.",
  "Carbanak": "Carbanak is a financially motivated group targeting financial institutions with spear-phishing campaigns followed by fraudulent banking operations.",
  "Chimera": "Chimera is a China-based threat group targeting the semiconductor industry and airline industry in Taiwan and beyond.",
  "Cinnamon Tempest": "Cinnamon Tempest is a China-based group deploying ransomware based on Babuk’s source code, targeting intellectual property theft rather than financial gain.",
  "Cleaver": "Cleaver is an Iranian group responsible for Operation Cleaver, targeting critical infrastructure across multiple countries.",
  "Cobalt Group": "Cobalt Group is a financially motivated threat group, targeting financial institutions globally through malware designed to manipulate ATMs and card processing systems.",
  "Confucius": "Confucius is a South Asian espionage group targeting military and government organizations, with overlapping tools and tactics with Patchwork.",
  "CopyKittens": "CopyKittens is an Iranian cyber espionage group active since 2013, targeting government and private sectors globally, including the US, Germany, and Israel.",
  "CURIUM": "CURIUM is an Iranian group that focuses on establishing long-term social engineering relationships before delivering malware.",
  "CyberAv3ngers": "CyberAv3ngers is an IRGC-affiliated group targeting Israel's critical infrastructure, operating since 2020.",
  "Dark Caracal": "Dark Caracal is a Lebanese group attributed to the General Directorate of General Security, active since at least 2012, conducting global cyber espionage operations.",
  "Darkhotel": "Darkhotel is a South Korean group targeting executives in East Asia, often via hotel networks.",
  "DarkHydrus": "DarkHydrus is a Middle Eastern group targeting government agencies and educational institutions using open-source tools.",
  "DarkVishnya": "DarkVishnya is a financially motivated actor targeting banks in Eastern Europe, often using physical devices for network access.",
  "Deep Panda": "Deep Panda is a Chinese group targeting industries like healthcare and telecommunications, linked to the Anthem intrusion.",
  "Dragonfly": "Dragonfly is a Russian group targeting critical infrastructure sectors such as defense, energy, and aviation, often using supply chain attacks.",
  "DragonOK": "DragonOK is a Chinese group targeting Japanese organizations via phishing campaigns, deploying malware such as PlugX and PoisonIvy.",
  "Earth Lusca": "Earth Lusca is a China-based group targeting governments, media, and research organizations across Asia and Europe.",
  "Elderwood": "Elderwood is a Chinese group linked to the Operation Aurora attack on Google, targeting defense and human rights organizations.",
  "Ember Bear": "Ember Bear is a Russian group targeting Ukraine and Georgia, linked to the WhisperGate attacks.",
  "Equation": "Equation is a highly sophisticated group believed to be linked to the NSA, known for firmware-based attacks and advanced malware.",
  "Evilnum": "Evilnum is a financially motivated group active since at least 2018, targeting financial institutions.",
  "EXOTIC LILY": "EXOTIC LILY is a financially motivated group linked to Wizard Spider, deploying ransomware such as Conti.",
  "Ferocious Kitten": "Ferocious Kitten is an Iranian group targeting Persian-speaking individuals, often using custom malware to gather intelligence.",
  "FIN10": "FIN10 is a financially motivated group extorting North American organizations through data theft and ransomware.",
  "FIN11": "A financially motivated group linked to Eastern Europe, conducting large-scale phishing campaigns with malicious documents and malware like FRIENDSPEAK and MIXLABEL, focused on financial gain and evasion of detection.",
  "FIN13": "FIN13 is a Latin American financial cyber threat group targeting financial institutions for theft of intellectual property.",
  "FIN4": "FIN4 is a financial group focused on capturing email credentials in the financial market, particularly in the healthcare and pharmaceutical sectors.",
  "FIN5": "FIN5 is a financially motivated group targeting payment card data in the restaurant, gaming, and hotel industries, active since 2008.",
  "FIN6": "FIN6 is a cybercrime group known for stealing payment card data from point-of-sale (PoS) systems in the hospitality and retail sectors.",
  "FIN7": "FIN7 is a financially motivated group targeting the retail, restaurant, and hospitality sectors, using phishing and malware such as Carbanak for payment card theft.",
  "FIN8": "FIN8 is a financially motivated group targeting PoS devices in hospitality, retail, and financial sectors, with ransomware and cryptocurrency mining malware.",
  "Fox Kitten": "Fox Kitten is an Iranian group targeting critical infrastructure sectors, including oil and gas, and government organizations in the Middle East.",
  "GALLIUM": "GALLIUM is a Chinese cyber espionage group targeting telecommunications and financial institutions, with a focus on the Operation Soft Cell campaign.",
  "Gallmaker": "Gallmaker is a cyber espionage group targeting defense and military sectors using fileless malware and leveraging legitimate tools for espionage operations.",
  "Gamaredon Group": "Gamaredon Group is a Russian threat group targeting Ukrainian government entities, using spear-phishing, VBA macros, and PowerShell for data exfiltration.",
  "GCMAN": "GCMAN is a group targeting banks for fraudulent transfers to e-currency services, often using sophisticated financial tools.",
  "GOLD SOUTHFIELD": "GOLD SOUTHFIELD is a financially motivated group operating the REvil Ransomware-as-a-Service (RaaS) platform, active since 2018.",
  "Gorgon Group": "Gorgon Group is a Pakistan-based group targeting government organizations in the US, Russia, Spain, and the UK through criminal and espionage attacks.",
  "Group5": "Group5 is a suspected Iranian group targeting Syrian opposition via spear-phishing and watering hole attacks using RATs like njRAT and NanoCore.",
  "HAFNIUM": "HAFNIUM is a Chinese state-sponsored group targeting US entities across sectors like infectious disease research, law firms, and defense contractors.",
  "HEXANE": "HEXANE is a cyber espionage group targeting oil & gas, telecommunications, and ISPs in the Middle East and Africa, with tactics similar to APT33 and OilRig.",
  "Higaisa": "Higaisa is a suspected South Korean group targeting public organizations in North Korea, Japan, Russia, and other countries for espionage purposes.",
  "Inception": "Inception is a Russian cyber espionage group targeting industries worldwide, particularly government entities in Europe and Asia.",
  "IndigoZebra": "IndigoZebra is a Chinese group targeting Central Asian governments through sophisticated phishing and malware deployment.",
  "Indrik Spider": "Indrik Spider is a Russian group known for ransomware operations like BitPaymer and WastedLocker, targeting financial and technology sectors.",
  "Ke3chang": "Ke3chang is a Chinese cyber espionage group targeting diplomatic, military, and oil organizations, often using spear-phishing campaigns.",
  "Kimsuky": "Kimsuky is a North Korean group targeting think tanks, government organizations, and individuals involved in Korean Peninsula issues.",
  "LAPSUS$": "LAPSUS$ is a cybercriminal group active since 2021, specializing in large-scale social engineering and extortion campaigns against global organizations.",
  "Lazarus Group": "Lazarus Group is a North Korean group known for financial theft and espionage, deploying malware like HOPLIGHT and FALLCHILL against financial institutions and cryptocurrency exchanges.",
  "LazyScripter": "LazyScripter is a group targeting the airline industry using open-source toolsets for cyber espionage campaigns.",
  "Leafminer": "Leafminer is an Iranian group targeting Middle Eastern government organizations and businesses, active since 2017.",
  "Leviathan": "Leviathan is a Chinese group targeting maritime industries and defense contractors for intellectual property theft through spear-phishing and malware deployment.",
  "Lotus Blossom": "Lotus Blossom is a Chinese group targeting Southeast Asian government and military organizations, often using spear-phishing attacks.",
  "LuminousMoth": "LuminousMoth is a Chinese-speaking group targeting government entities in Myanmar, the Philippines, and Southeast Asia using custom malware.",
  "Machete": "Machete is a Spanish-speaking cyber espionage group targeting Latin American organizations with spear-phishing campaigns focusing on government and diplomatic entities.",
  "Magic Hound": "Magic Hound is an Iranian group conducting cyber espionage campaigns against government and military personnel in Europe, the US, and the Middle East.",
  "Malteiro": "Malteiro is a Brazilian financially motivated group targeting victims in Latin America with the Mispadu banking trojan distributed via Malware-as-a-Service.",
  "menuPass": "menuPass is a Chinese group active since 2006, targeting industries like aerospace, government, and defense, often linked to the MSS.",
  "Metador": "Metador is a suspected cyber espionage group targeting telecommunication companies and ISPs in the Middle East and Africa.",
  "Moafee": "Moafee is a Chinese group targeting Japanese organizations with phishing and malware attacks, overlapping with the DragonOK group.",
  "Mofang": "Mofang is a Chinese group targeting critical infrastructure in Myanmar and other countries, using imitative tactics to compromise networks.",
  "Molerats": "Molerats is an Arabic-speaking group targeting Middle Eastern, European, and US organizations through politically motivated campaigns.",
  "Moses Staff": "Moses Staff is an Iranian group targeting Israeli companies, focused on leaking sensitive data without demanding a ransom.",
  "MoustachedBouncer": "MoustachedBouncer is a group targeting foreign embassies in Belarus, using espionage campaigns to collect sensitive diplomatic data.",
  "MuddyWater": "MuddyWater is an Iranian group targeting Middle Eastern and Central Asian organizations with spear-phishing attacks deploying malware like POWERSTATS.",
  "Mustang Panda": "Mustang Panda is a Chinese group targeting government entities, nonprofits, and religious organizations in the US, Europe, and Southeast Asia.",
  "Mustard Tempest": "Mustard Tempest is an initial access broker operating the SocGholish network since 2017, collaborating with Indrik Spider for additional malware deployment.",
  "Naikon": "Naikon is a Chinese cyber espionage group targeting Southeast Asian governments and international organizations like the UNDP.",
  "NEODYMIUM": "NEODYMIUM is a group active since 2016, targeting Turkish victims with campaigns linked to BlackOasis and PROMETHIUM.",
  "Nomadic Octopus": "Nomadic Octopus is a Russian group targeting Central Asian governments and diplomatic missions, using custom Android and Windows malware.",
  "OilRig": "OilRig is an Iranian group targeting Middle Eastern and international organizations through supply chain attacks and public-facing application exploits.",
  "Orangeworm": "Orangeworm is a group targeting healthcare organizations globally, using malware like Kwampirs for espionage and intellectual property theft.",
  "Patchwork": "Patchwork is a group linked to India, targeting diplomatic entities and think tanks through spear-phishing with malware like BADNEWS.",
  "PittyTiger": "PittyTiger is a Chinese group using various malware to maintain command and control, targeting global organizations.",
  "PLATINUM": "PLATINUM is an espionage group targeting South and Southeast Asian governments, active since at least 2009.",
  "POLONIUM": "POLONIUM is a Lebanese group targeting Israeli organizations, collaborating with Iranian actors for advanced espionage campaigns.",
  "Poseidon Group": "Poseidon Group is a Portuguese-speaking group using blackmail tactics, targeting companies for information theft and forcing them to contract Poseidon as a security firm.",
  "PROMETHIUM": "PROMETHIUM is an espionage group targeting Turkish organizations, operating globally with overlapping characteristics with NEODYMIUM.",
  "Putter Panda": "Putter Panda is a Chinese group linked to Unit 61486 of the PLA, targeting aerospace and defense sectors globally.",
  "Rancor": "Rancor is a group targeting Southeast Asian entities using politically motivated lures to deploy malicious documents.",
  "Rocke": "Rocke is a Chinese-speaking group focused on cryptojacking by leveraging victim systems to mine cryptocurrency, active since at least 2018.",
  "RTM": "RTM is a Russian cybercriminal group targeting remote banking systems in Russia and neighboring countries with malware.",
  "Sandworm Team": "Sandworm Team is a Russian group targeting critical infrastructure, deploying destructive malware like BlackEnergy and Industroyer.",
  "Scarlet Mimic": "Scarlet Mimic is a Chinese-linked group targeting minority rights activists through espionage campaigns with custom malware.",
  "Scattered Spider": "Scattered Spider is an English-speaking cybercriminal group targeting telecommunications and technology companies, deploying ransomware for financial gain.",
  "SideCopy": "SideCopy is a Pakistani group targeting Indian and Afghani government personnel through spear-phishing campaigns mimicking Sidewinder tactics.",
  "Sidewinder": "Sidewinder is an Indian group targeting military and business entities across Asia, especially Pakistan and China, using advanced malware.",
  "Silence": "Silence is a financially motivated group targeting banks and ATMs, focused on fraudulent transfers using legitimate banking tools.",
  "Silent Librarian": "Silent Librarian is an Iranian group targeting universities and government agencies for intellectual property theft, linked to the Iranian Mabna Institute.",
  "SilverTerrier": "SilverTerrier is a Nigerian cybercriminal group targeting organizations in the technology and manufacturing sectors, known for using commodity malware.",
  "Sowbug": "Sowbug is a group targeting South American and Southeast Asian government entities through espionage campaigns focused on data exfiltration.",
  "Stealth Falcon": "Stealth Falcon is a UAE-linked group targeting Emirati journalists, activists, and dissidents through spyware campaigns.",
  "Strider": "Strider is a group targeting victims in Russia, China, Sweden, and Iran, using sophisticated espionage malware for long-term operations.",
  "Suckfly": "Suckfly is a Chinese group targeting government and private-sector organizations in Asia and North America, active since at least 2014.",
  "TA2541": "TA2541 is a cybercriminal group targeting aviation, aerospace, and defense industries using remote access trojans (RATs) and phishing campaigns.",
  "TA459": "TA459 is a Chinese group targeting Russian, Belarusian, and Mongolian organizations through espionage campaigns.",
  "TA505": "TA505 is a financially motivated group known for large-scale malspam campaigns, distributing malware like Clop ransomware and FlawedAmmyy RAT.",
  "TA551": "TA551 is a financially motivated group active since 2018, targeting organizations with email-based malware distribution campaigns.",
  "TeamTNT": "TeamTNT is a group targeting cloud and container environments to deploy cryptocurrency miners and perform data theft.",
  "TEMP.Veles": "TEMP.Veles is a Russian group targeting critical infrastructure, using the TRITON malware framework to manipulate industrial safety systems.",
  "The White Company": "The White Company is a likely state-sponsored group targeting Pakistani government and military organizations, active since 2017.",
  "Threat Group-1314": "Threat Group-1314 is an unattributed group using compromised credentials to access victims’ remote access infrastructure.",
  "Threat Group-3390": "Threat Group-3390 is a Chinese group targeting aerospace, government, and defense sectors through web compromises and malware.",
  "Thrip": "Thrip is a Chinese-linked group targeting satellite communications, defense contractors, and telecommunications companies.",
  "ToddyCat": "ToddyCat is a sophisticated group active since 2020, targeting government and military organizations across Europe and Asia using custom loaders and multi-stage malware.",
  "Tonto Team": "Tonto Team is a Chinese group targeting government and military organizations in South Korea, Japan, and the US using spear-phishing and espionage malware.",
  "Transparent Tribe": "Transparent Tribe is a Pakistan-based group targeting Indian and Afghan defense and government organizations through spear-phishing and remote access trojans.",
  "Tropic Trooper": "Tropic Trooper is a group targeting government, healthcare, and high-tech industries in Taiwan and the Philippines using custom malware.",
  "Turla": "Turla is a Russian group targeting government and diplomatic entities worldwide, using sophisticated malware like Snake and Carbon.",
  "UNC788": "UNC788 is an Iranian group targeting individuals in the Middle East using spear-phishing and malware deployment.",
  "Volatile Cedar": "Volatile Cedar is a Lebanese group targeting companies and institutions worldwide, focusing on espionage and political interests.",
  "Volt Typhoon": "Volt Typhoon is a Chinese state-sponsored group targeting critical infrastructure in the US, focusing on espionage and information gathering.",
  "Whitefly": "Whitefly is a Chinese group targeting Singapore-based organizations, primarily interested in stealing sensitive information, such as healthcare data.",
  "Windigo": "Windigo is a group compromising Linux and Unix servers since 2011, using the Ebury SSH backdoor to create a spam botnet.",
  "Windshift": "Windshift is a group targeting government departments and critical infrastructure in the Middle East for surveillance purposes.",
  "Winnti Group": "Winnti Group is a Chinese group targeting gaming and software companies through supply chain attacks, using malware like PlugX and ShadowPad.",
  "WIRTE": "WIRTE is a group targeting government and diplomatic organizations in the Middle East and Europe, using malware to exfiltrate sensitive data.",
  "Wizard Spider": "Wizard Spider is a Russia-based group known for operating TrickBot malware and deploying Ryuk and Conti ransomware in high-value campaigns.",
  "ZIRCONIUM": "ZIRCONIUM is a Chinese group targeting individuals involved in US presidential elections and international affairs, active since at least 2017."
}
