{
    "APT29 (Cozy Bear)": "Associated with Russian intelligence, APT29 employs sophisticated tactics for espionage. TTPs include spear-phishing with malicious attachments exploiting vulnerabilities in Adobe Flash (CVE-2015-5119) and Java (CVE-2015-2590). They deploy custom malware like SeaDuke (Python-based backdoor) and CloudDuke (modular malware) for persistent backdoors. The group uses living off the land techniques, leveraging legitimate tools such as PowerShell for stealthy operations. They perform privilege escalation through system vulnerabilities and lateral movement using stolen credentials. Advanced encryption (AES-256) and obfuscation techniques are used to secure malware and communications, allowing for long-term persistence in target networks, often remaining undetected for months or years.",

    "APT28 (Fancy Bear)": "This Russian military intelligence-linked group is known for aggressive tactics targeting government and military entities. TTPs include spear-phishing campaigns with malicious attachments or fake login pages, exploiting zero-day vulnerabilities in Microsoft Office (CVE-2015-1701) and Adobe Flash (CVE-2015-3043). They deploy custom malware like X-Agent (modular implant) and Sofacy (downloader), utilizing credential harvesting techniques for lateral movement. APT28 employs living off the land methods for stealth and advanced evasion techniques to avoid detection, focusing on critical infrastructure and sensitive governmental systems.",

    "APT41": "A Chinese-linked group with a dual focus on espionage and financial gain. TTPs include exploitation of vulnerabilities in web-facing applications, particularly targeting managed service providers. They conduct supply chain attacks by compromising software development companies. Custom malware like Winnti is used for long-term access, while advanced lateral movement techniques facilitate data exfiltration through encrypted channels. APT41 targets multiple sectors including gaming, telecommunications, and healthcare, demonstrating a broad operational scope.",

    "Lazarus Group": "This North Korean-associated group is notorious for espionage and financial theft. TTPs include spear-phishing emails with malicious attachments that exploit Microsoft Office vulnerabilities. They execute watering hole attacks by compromising legitimate websites to deliver malware. Sophisticated malware such as HOPLIGHT (proxy tool) and FALLCHILL (RAT) are deployed to target financial institutions and cryptocurrency exchanges. The group utilizes custom-developed tools for network infiltration along with advanced obfuscation techniques to evade detection.",

    "APT33 (Elfin)": "An Iranian-linked group primarily targeting aerospace and energy sectors. TTPs include spear-phishing emails themed around job offers containing malicious attachments that exploit Microsoft Office vulnerabilities. They deploy custom malware like DROPSHOT (wiper) and TURNEDUP (backdoor), alongside aggressive brute-force attacks against exposed services. APT33 uses web shells extensively for persistence, particularly focusing on industrial control systems.",

    "Winnti Group": "This Chinese-linked group mainly targets gaming and software companies through supply chain attacks. TTPs involve compromising build servers to inject malware into legitimate software. They utilize sophisticated malware like PlugX (modular malware) and ShadowPad (backdoor), stealing code-signing certificates to sign their malware. Advanced persistence techniques, including firmware-level implants, are employed alongside extensive living off the land techniques to target source code repositories and intellectual property.",

    "Equation Group": "Believed to be linked to the NSA, this group is known for highly sophisticated operations targeting high-value entities worldwide. TTPs include exploiting zero-day vulnerabilities in firmware and hard drive controllers, using advanced malware such as EquationDrug (modular platform) and GrayFish (validator implant). Their persistence techniques survive system reinstalls, allowing them to target air-gapped networks effectively. They employ complex multi-stage attack chains along with advanced encryption methods for secure communications.",

    "APT10 (Stone Panda)": "A Chinese-linked group targeting managed service providers and their clients. TTPs include spear-phishing attacks combined with exploitation of public-facing applications. They deploy malware like ChChes (modular backdoor) and Quasar RAT while employing advanced techniques to blend in with normal network traffic. The group uses legitimate tools for lateral movement, focusing on intellectual property theft across multiple industries with long-term persistence in compromised networks.",

    "Turla (Snake)": "This Russian-associated group is known for complex operations targeting government and diplomatic entities. TTPs include exploiting outdated web servers through watering hole attacks while deploying modular malware like Snake and Carbon. They hijack satellite connections for covert communications and utilize complex multi-layered obfuscation techniques to evade detection, employing advanced lateral movement and privilege escalation methods throughout their campaigns.",

    "APT32 (OceanLotus)": "A Vietnamese-linked group targeting foreign companies and political dissidents. TTPs involve spear-phishing with malicious attachments disguised as fake installer files, using Cobalt Strike and Korplug malware hidden within legitimate software packages. They employ creative obfuscation techniques to evade detection alongside extensive living off the land methods, focusing on human rights organizations and foreign governments while utilizing advanced data exfiltration methods.",

    "Dragonfly (Energetic Bear)": "This Russian-linked group targets energy and industrial sectors through espionage tactics aimed at critical infrastructure. TTPs include watering hole attacks combined with trojanized software updates to compromise industrial control systems. They deploy malware like Havex and Backdoor.Oldrea while gathering information about ICS environments using custom-developed tools for network infiltration, maintaining long-term persistence within compromised networks.",

    "APT3 (Gothic Panda)": "A Chinese-linked group recognized for rapid exploitation of newly discovered vulnerabilities across various sectors including aerospace and defense. TTPs include spear-phishing campaigns coupled with watering hole attacks that exploit zero-day vulnerabilities in popular software shortly after disclosure. They deploy custom malware like Pirpi and CookieCutter while employing advanced lateral movement techniques focused on sensitive data extraction.",

    "Carbanak": "A financially motivated group primarily targeting banks and financial institutions globally. TTPs involve highly targeted spear-phishing emails containing malicious attachments for initial access followed by deployment of custom malware designed to monitor banking systems closely. This group maintains a long-term presence within compromised networks before executing fraudulent transfers using legitimate banking tools while employing sophisticated evasion techniques.",

    "APT37 (Reaper)": "This North Korean-linked group targets various sectors related to North Korean interests through sophisticated spear-phishing campaigns that exploit zero-day vulnerabilities in Microsoft Office products. Their deployment of malware such as ROKRAT (remote access tool) allows them to target chemicals, electronics industries while employing social engineering techniques for initial access alongside advanced data exfiltration methods aimed at individuals associated with North Korean political interests.",

    "Sandworm Team": "A Russian-associated group focused on disrupting critical infrastructure through destructive attacks against government entities. TTPs involve exploiting vulnerabilities in industrial control systems along with spear-phishing tactics for initial access leading to deployment of wiper malware like BlackEnergy & Industroyer capable of disrupting power grids significantly affecting energy sectors through advanced manipulation of industrial processes.",

    "APT39 (Chafer)": "An Iranian group concentrating on personal information theft primarily from telecommunications and travel industries through exploitation of VPN system vulnerabilities alongside spear-phishing tactics for initial access leading to deployment of malware such as SEENPUP & CACHEMONEY aimed at long-term data exfiltration operations utilizing advanced persistence techniques.",

    "FIN7": "A financially motivated group that targets point-of-sale systems within retail, hospitality sectors using highly targeted spear-phishing emails masquerading as legitimate business communications followed by deployment of custom malware such as Carbanak & Bateleur designed specifically for monitoring banking operations while employing advanced social engineering methods alongside legitimate penetration testing tools repurposed maliciously to steal payment card data effectively.",

    "Leviathan (TEMP.Periscope)": "This Chinese-linked group targets maritime engineering sectors focusing on intellectual property theft via spear-phishing campaigns coupled with watering hole attacks exploiting common software vulnerabilities leading to deployment of malware such as Airbreak & Badflick aimed at defense contractors while employing advanced long-term data exfiltration methods utilizing custom-developed tools designed specifically for network infiltration.",

    "APT34 (OilRig)": "An Iranian group targeting Middle Eastern organizations utilizing spear-phishing tactics involving malicious macros alongside exploitation of public-facing applications leading to deployment of malware such as TRIGONA & HELMINTH designed specifically for maintaining persistence via web shells while focusing on government financial sectors employing advanced obfuscation techniques designed specifically to evade detection efforts.",

    "Patchwork (Dropping Elephant)": "Possibly Indian-linked group targeting diplomatic entities through highly targeted spear-phishing campaigns utilizing malicious RTF files exploiting known vulnerabilities leading to deployment of custom backdoors such as BADNEWS & Ragnatela aimed at gaining persistent access within diplomatic government organizations employing extensive social engineering techniques tailored towards regional geopolitical themes.",

    "MuddyWater": "An Iranian-linked group targeting Middle Eastern & Central Asian organizations via spear-phishing tactics involving malicious macro-enabled documents leading towards deployment of malware such as POWERSTATS & SHARPSTATS utilizing legitimate tools/services during command-and-control phases focusing primarily on telecommunications & government sectors employing advanced living-off-the-land techniques alongside sophisticated social engineering during initial access phases.",
    
    "APT40 (TEMP.Periscope)": "Chinese group focusing on maritime industries utilizing spear-phishing tactics combined with watering hole attacks exploiting web application vulnerabilities leading towards deployment of custom malware such as Derusbi & Gh0st RAT aimed at naval technology while maintaining advanced long-term persistence utilizing custom-developed tools specifically designed for effective data exfiltration.",
    
    "Silence": "A financially motivated group targeting banks through spear-phishing tactics involving malicious attachments exploiting Microsoft Office vulnerabilities followed by deployment of custom monitoring malware designed specifically for manipulating banking systems maintaining a long-term presence within compromised networks prior executing fraudulent transfers using legitimate banking tools effectively evading detection during operations focused primarily on ATM networks.",
    
    "APT38 (Lazarus Subgroup)": "North Korean subgroup focusing on large-scale financial theft utilizing exploitation of SWIFT banking system vulnerabilities alongside deployment of custom malware such as DYEPACK & NESTEGG designed specifically for maintaining long-term presence within compromised networks prior executing theft operations employing advanced covering tracks measures aimed at evading detection during cryptocurrency exchange hacks utilizing custom-developed network infiltration tools.",
    
    "BlackTech": "Possibly Chinese-linked group targeting technology companies across East Asia focusing on intellectual property theft via sophisticated supply chain attacks exploiting zero-day vulnerabilities leading towards deployment of custom malware such as PLEAD & Waterbear aimed at semiconductor high-tech industries employing advanced persistence techniques including stolen digital certificates used strategically sign their own malicious software.",
    
    "Thrip": "A Chinese-linked group specializing in targeting satellite defense organizations leveraging extensive living-off-the-land techniques utilizing legitimate tools like PsExec & LogMeIn during lateral movement phases leading towards deployment of custom malware such as Catchamas aimed at satellite communications geospatial imaging organizations employing stealthy operations designed specifically avoid detection during prolonged campaigns.",
    
    "APT19 (Codoso Team)":  "Chinese group targeting legal investment sectors via sophisticated spear-phishing campaigns combined with watering hole attacks leading towards deployment of custom backdoors such as Derusbi & Hikit aimed at intellectual property theft sensitive business data employing advanced lateral movement techniques ensuring persistent access within compromised environments.",
    
    "Machete":  "Spanish-speaking cyber espionage group primarily targeting Latin American organizations conducting highly targeted spear-phishing campaigns utilizing malicious attachments coupled extensive social engineering strategies leading towards deployment of information-gathering malware tailored towards government diplomatic entities ensuring advanced data exfiltration methods aligned geopolitical themes enhancing effectiveness phishing lures.",
    
    "Gallmaker":  "Group specializing in government military organizations leveraging fileless malware techniques utilizing legitimate tools like PowerShell during attack phases aiming at foreign policy institutions employing sophisticated obfuscation strategies designed evade traditional antivirus solutions ensuring successful infiltration through living-off-the-land tactics complemented by social engineering efforts during initial access phases.",
    
    "Kimsuky":  "North Korean group think tanks government organizations spear-phishing malicious attachments often exploiting current events deployment malware BabyShark KGH_SPY targeting individuals organizations related Korean peninsula issues use social media platforms reconnaissance advanced information theft long-term espionage continuous evolution tactics evade detection.",

    "APT35 (Charming Kitten)": "Iranian-linked group targeting government and defense sectors. TTPs include: Sophisticated spear-phishing campaigns using fake social media profiles. Deployment of custom malware like POWERSTATS and PICKPOCKET. Use of legitimate services like Google Sites for phishing infrastructure. Advanced social engineering techniques, including impersonation of journalists. Targeting of individuals involved in nuclear and military issues. Use of custom-developed tools for password spraying attacks.",

    "Hafnium": "Chinese state-sponsored group targeting various sectors. TTPs include: Exploitation of zero-day vulnerabilities in Microsoft Exchange servers. Use of web shells for persistent access. Deployment of custom malware like DEADEYE and BOUNCER. Advanced techniques for data exfiltration and lateral movement. Targeting of intellectual property and sensitive information across multiple industries. Use of legitimate tools and services to blend malicious activities with normal traffic.",

    "APT36 (Transparent Tribe)": "Pakistan-linked group focusing on government and military targets. TTPs include: Spear-phishing campaigns with geopolitical themes. Use of malicious macro-enabled documents for initial compromise. Deployment of custom RATs like Crimson and BreachRAT. Extensive use of social engineering techniques. Targeting of defense and government organizations in South Asia. Advanced persistence mechanisms and data exfiltration methods.",

    "FIN11": "Financially motivated group with possible ties to Eastern Europe. TTPs include: Large-scale phishing campaigns using malicious Microsoft Office documents. Deployment of custom malware like FRIENDSPEAK and MIXLABEL. Extensive use of Cobalt Strike for post-exploitation activities. Targeting of multiple sectors with a focus on financial gain. Advanced techniques for evading detection and maintaining long-term access.",

    "Gamaredon Group": "Russian-sponsored group targeting Ukrainian government entities. TTPs include: Spear-phishing campaigns with malicious attachments exploiting Microsoft Office vulnerabilities. Use of VBA macros and PowerShell scripts for initial access. Deployment of custom malware like Pterodo and Pteranodon. Advanced techniques for lateral movement and data exfiltration. Extensive use of living off the land binaries. Continuous evolution of tactics to evade detection.",

    "APT31 (Zirconium)": "Chinese-linked group targeting government and technology sectors. TTPs include: Use of novel malware families and custom-built tools. Exploitation of zero-day vulnerabilities in popular software. Advanced techniques for lateral movement and privilege escalation. Deployment of backdoors like SOGU and JNDI. Targeting of intellectual property and sensitive government information. Sophisticated methods for maintaining long-term persistence in compromised networks.",

    "TA505": "Financially motivated group with a global reach. TTPs include: Large-scale malspam campaigns distributing various malware families. Use of malicious Microsoft Office documents with macros. Deployment of backdoors like SDBbot and FlawedAmmyy. Advanced techniques for evading detection and analysis. Targeting of retail and financial sectors. Continuous evolution of tactics and malware to bypass security measures.",

    "APT27 (Emissary Panda)": "Chinese state-sponsored group targeting government and critical infrastructure. TTPs include: Use of watering hole attacks and strategic web compromises. Deployment of custom malware like HyperBro and PlugX. Exploitation of known vulnerabilities in networking equipment. Advanced lateral movement techniques using stolen credentials. Targeting of defense and technology sectors. Long-term persistence in compromised networks for espionage purposes.",

    "Wizard Spider": "Russian-speaking cybercrime group known for ransomware operations. TTPs include: Use of TrickBot malware for initial access and reconnaissance. Deployment of Ryuk and Conti ransomware. Sophisticated lateral movement techniques using Cobalt Strike. Exploitation of vulnerabilities in remote access tools. Advanced evasion techniques to avoid detection. Targeting of large enterprises and critical infrastructure for high-value ransoms."
}
    