[
  {
    "summary_theme": "advanced persistent threats",
    "data_type": "text",
    "content": "Information from APTs should be included as examples of commonly known TTPs. All runs should include at a minimum TTPs from known groups. If specific APTs are known, or suspected, to be targeting the system under evaluation, the TTPs should be considered more strongly, and the defensive measures that would be likely to prevent these APTs from gaining access should be scored more heavily both in terms of points for or against the algorithm. The suspected APTs that should be considered are: NONE."
  },
  {
    "summary_theme": "company",
    "data_type": "text",
    "content": "A small business company named “MRZTech” that develops, tests, fields, and sustains high technology products that are in high demand and fulfill a unique market niche. MRZTech customers are extremely satisfied with the products, and they have become key components within the critical missions for these customer organizations. This requires MRZTech to maintain certain critical functions for internal operations at all times in order to meet the customer’s needs."
  },
  {
    "summary_theme": "detected vulnerabilities",
    "data_type": "text",
    "content": "The five table vulnerabilities.json lists the vulnerabilities that are present on the company information system under evaluation. For the purpose of this evaluation, assume that all computer Ports, Protocols, and Services (PPS) needed to exploit each listed vulnerability are enabled on the endpoint and network devices. Also assume that the company proprietary software applications that provide the functions described mapped in company_critical_functions_definition.json and company_critical_functions_mapping.json do not have any known vulnerabilities. The Common Vulnerability and Exposure (CVE) numbers provided in the vulnerabilities.json table are reference numbers for a given vulnerability used on the MITRE CVE website. The National Institute of Standards and Technology (NIST) has a National Vulnerability Database (NVD) that includes the CVEs and they assign a Common Vulnerability Scoring System (CVSS) score to each vulnerability to recommend a severity rating if the vulnerability were successfully exploited. The NVD also provides a CVSS Calculator to allow cybersecurity engineers to adjust the default NVD CVSS score for a given vulnerability if it is deemed appropriate. Some of the NVD CVSS scores use the Version 2 calculator while others use the Version 3.x calculator, so when both CVSS scores are provided for a given vulnerability the Version 3.x calculator value should be used for this evaluation."
  },
  {
    "summary_theme": "operational policies",
    "data_type": "text",
    "content": ""
  },
  {
    "summary_theme": "personnel training",
    "data_type": "text",
    "content": "The IT staff has a mix of training and experience. Some IT staff have received IT and cybersecurity certifications in the past but they have since expired. Other staff have had some IT training but limited on-the-job experience and they have had no cybersecurity training. One IT staff member has years of IT and cybersecurity experience, has formal technical education, and has a number of IT and cybersecurity certifications. This single staff member seems to be doing the vast majority of the work and they are overworked. They were hired into the company within the past 6 months to improve the information system security, but the system architecture is already deployed and there is no funding to make improvements until next year."
  },
  {
    "summary_theme": "physical security",
    "data_type": "text",
    "content": "The company site consists of discrete spaces for the work areas: Engineering and Production management, Test Engineering, Production floor (not part of this evaluation), Information Technology and Cybersecurity, and Company Management. The facility also has a Main Lobby area for visitors and during normal business hours there is a Security Guard to control visitor access to the facility. There may be some problems with the facility layout that could impact the company’s cyber resiliency in the event of an outsider threat or insider threat event. Competitor companies and foreign governments very much was access to MRZTech’s products design artifacts and test data as well as the unique Intellectual Property (IP) information that the company has created. Company facility is next to a river and is in the flood plain. Company facility implements some physical security measures to include a Security Guard desk at the main entrance that is staffed Monday-Friday 8:00 AM to 5:00 PM. The main entrance is locked when the Guard is not on duty but allows employees to exit if they work late (sometimes the door does not close all the way if employees do not make sure it catches). The production staff are responsible for opening the production floor door in the morning and locking it at the end of each day using a key lock, and all production staff have the key. An after-hours alarm system that only monitors the main entrance door and the production floor door is implemented and it is monitored by a commercial service over a telephone line link. All employees know the alarm code in the event they need to work late or have to come into work over the weekend. The last employee leaving the facility in the evening is responsible for activating the alarm. Company has an equipment room that contains all the Information Technology (IT) equipment racks and the room has a single door with a key lock. All the IT staff have the door key and the door is usually left unlock during normal business hours but it is supposed to be locked whenever there are no IT staff present in the room per the company policy. The IT staff does not always lock the door if they step out and “expect” to be back in 15 minutes or less. The equipment racks in the space do not have locks and neither does the equipment spares cabinet. Company has a room for the Engineering and Production staff and it has a single entrance door but there is not door lock or any other physical access control mechanism. The belief is that the Security Guard at the main entrance will control visitors and all the company staff is trusted. Company has a room for the product test and evaluation, and it has a single door but it is accessed through the Engineering and Production room. It also does not have a key lock or any other physical access control mechanism. Company Management offices are comprised of a suite of rooms that are accessed from a single door. That door has a key lock to secure the office space after hours. The door is unlocked during normal business hours but a PIN keypad is used to gain access. The individual offices in the management suite do not have locks on their doors. Assume the company Product floor is all Industrial Control System (ICS) components that is standalone with no computer network connections to the company information system under evaluation. The production ICS is not part of this evaluation. There is a door between the Engineering and Production space and the Production floor. It has a key lock but no one uses it, and they can’t find the key, and there is no other physical access control mechanism being used."
  },
  {
    "summary_theme": "system critical functions",
    "data_type": "array of text",
    "content": {
      "criticality ratings": "The company information system provides fifteen functions that the product engineering and production, test engineering, IT and cybersecurity, and company management work areas use. File company_critical_functions_definition.json lists the company critical functions that are provided by the company’s proprietary application software that is installed on the workstations, laptops, and servers. A given function may execute on a single endpoint node within the information system or it may be distributed across multiple nodes as illustrated in the file company_critical_functions_mapping.json. The computer network infrastructure components that interconnect all the nodes will also be critical for the distributed functions to the highest criticality value of the functions that rely on the network components. The file company_critical_functions_mapping.json maps the software functions to the information system endpoint nodes that are required to execute those functions. A “1” in the matrix indicates that all or a portion of the function is executed on an endpoint. Once simple method for assessing the criticality of an endpoint node (hardware and software) using the matrix mapping is to apply the “highwater mark” technique. For a given node in the file company_critical_functions_mapping.json, scan the row to find the “1” that is in the highest criticality column, and that would be considered the highwater mark. For example, the Server Rack, Server #4 executes functions F4, F8, and F9, and since F4 has a criticality value of “High” in the file company_critical_functions_definition.json, then the Server #4 criticality is also considered “High”. Likewise, the Engineering & Production (Workstation 4) executes functions F7 and F11, and since function F7 is assessed as Medium criticality in the file company_critical_functions_definition.json while function F11 is assessed as Low criticality, the criticality of Workstation 4 is Medium.",
      "high criticality": "The company must maintain all High criticality functions at all times to meeting vital product development, test, and delivery to customers and to maintain timely customer support for fielded products. There are also contractual and safety reasons for having to maintain all High criticality functions. No interruption in critical functions is acceptable during cyber attacks on the company information system from external threats or internal threats or during natural disasters. IT and cybersecurity services within the company information system are considered High criticality.",
      "medium criticality": "The company can accept partial or complete interruption of Medium criticality functions for no longer then 1 month before it will begin impacting operations. Product development, test, production, and fielding can still be completed but the process is slowed down and is more expensive when medium criticality functions are degraded or denied for an extended period of time. Work arounds are defined to continue company operations when Medium criticality functions are disrupted.",
      "low criticality": "The company can accept long term degradation or denial of Low criticality functions. It is considered a nuisance if Low criticality functions are not available but it will not impact product development, test, production, and fielding in any way and will have minimum impact on company management."
    }
  },
  {
    "summary_theme": "systems",
    "data_type": "text",
    "content": "The company uses proprietary application software for all the engineering and production, test engineering, and company management functions. This proprietary application software will not be part of the system under evaluation for this challenge. Information system boundary Firewall Intrusion Prevention System (IPS) rulesets are not up-to-date. Some of the hardware and software components within the company information system have reached “end-of-life”. This means that the component manufacturer no longer supports the hardware or software item, and as a result will not provide security patches to firmware or software for any newly discovered vulnerabilities. Nodes within the company information system have not had the latest security patches installed leaving open vulnerabilities. Some vulnerabilities have been known for some time but can not be patched since some of the application software providing critical functions will stop working. Nessus vulnerability scanner has not been updated with the latest plugins, where a single plugin performs an automated test to detect the presence of a specific known vulnerability on a commercial hardware or software item. This has resulted in the IT staff performing vulnerability scans on the system in compliance with company policy but are not detecting the new vulnerabilities on the information system. The Information Technology (IT) staff have implemented user accounts processes and monitoring procedures and have implemented Role Based Access Control (RBAC) with four defined roles: System Administrator (SA) – The SA role has “root” level privileges to all IT equipment, cybersecurity capability and tools, and all data stored on the workstations and laptops, servers, and SANS storage locations to include the Archive and Archive Backup locations. All IT staff are assigned the SA role and the IT staff is responsible for performing all cybersecurity tasks and data management tasks. Engineering and Production (EP) – The EP role has “owner” privileges to all software applications and tools used during product and system development, configuration management, integration, production, fielding, and sustainment. This role also has access to all the engineering and production data for all the company projects. All the company engineering and production staff are assigned the EP role. Test Engineering (TE) – The TE role has “owner” privileges to all the software applications used to test the company products during development and integration as well as the production units. The TE role also has “owner” privileges to all test plans, test procedures, product under test configuration information, and test data. All company test engineering staff are assigned the TE role. Company Management (CMgmt) – The CMgmt role has “owner” privileges to all the company sensitive information to include Human Resources records, Payroll records, Project Management records, Legal records, and personnel managers records to include the company Vice President and President records. All company management staff are assigned the CMgmt role."
  },
  {
    "summary_theme": "system equipment",
    "data_type": "array of text",
    "content": {
      "equipment": "The following subsections describe the information system equipment racks and the hardware and software installed in the racks that will be part of the system under evaluation for this evaluation. The company has developed a suite of proprietary application software for their engineering and production, test engineering, and company management work areas. The company asserts that the application software does not have any vulnerabilities, so the application software will not be part of the system under evaluation for this evaluation other than evaluating the criticality of the functions the software performs. The evaluation will be limited in scope to just the operating systems and specific commercial tools used for cybersecurity.",
      "boundary defense and system administration rack": "The company facility will have a Boundary Defense and System Administration Rack that will include a Cisco Firepower Firewall with an Intrusion Prevention System (IPS). All external network traffic passing into or out of the facility will be routed through the Firewall and rulesets will be developed to only permit the required data flows. The IPS will be updated periodically with the latest Cisco signatures in order to detect well known cyber attacks, and specific alert types and automated response actions will be configured on the IPS by the facility Information Technology (IT) System Administrator for each signature category. The rack will include a Cisco Layer 3 Switch that will interconnect the internal rack components as well as provide the interface to the other equipment racks within the facility. External network traffic that successfully passes through the Firewall will then be routed through the Layer 3 Switch to the end node destination. The rack will include PowerEdge Servers with a dedicated server for the Virtualization Management, Cybersecurity Capability and Tools, and Computer and Network Audit Log Server functions. Each server will have a bulk data Storage Area Network (SANS) location. A built-in monitor, keyboard, and track ball will be part of the equipment rack and will provide the location where the System Administrator will configure and monitor the IT internal to the facility, perform cybersecurity tasks, and manage the user accounts. It will also be the location where the Virtualization Management will be performed when virtual machines are instantiated on the Server Racks for the production and test activities. A patch panel will provide a central cable management point for all the internal equipment interconnection in the rack. It will also allow for easier reconfiguration of the rack interconnect if it becomes necessary. The rack will include an Uninterruptible Power Supply with a power conditioner that will provide emergency power backup in the event of a primary facility power interruption. The Cybersecurity Tools will consist of an Identity Management (IdM) server, a Splunk Security Information and Event Manager (SIEM), McAfee Anti-Virus scanner, and Nessus vulnerability scanner to monitor the facility operations and ensure the information systems are secure. The facility IT System Administrator will routinely monitor the SIEM for cybersecurity alerts and will initiate internal cybersecurity tests, such as Anti-Virus scans and Nessus vulnerability scans, of all installed IT in compliance with the company cybersecurity policy and procedures. The facility System Administrator will also perform user account management from the Boundary Defense and System Management rack through the IdM service. The System Administrator will validate all user accounts are still valid and that each user has the appropriate roles assigned at least monthly per the company cybersecurity policy and procedures. The file hardware.json and software.json provide the hardware and software list, respectively, for the Boundary Defense and System Administration Rack.",
      "server rack": "The Server Rack provides the common computing resources for the entire company to include the engineering and production, test engineering, and company management work areas. The IT and cybersecurity work area separated and is implemented on a dedicated Boundary Defense and System Administration Rack. The Server Rack contains multiple PowerEdge R750 ESXi Servers and PowerVault Storage Area Network (SANS) servers and they will be used within the facility to: - Provides the product design, development, and test tools, - Process and display technical data library artifacts that describe the systems and products under development and test within the organization to include sensitive Intellectual Property (IP) information, - Product Help Desk Response Ticketing System application software and record database software. The engineering and production work area will provide a Help Desk to respond to customer questions and comments. The Help Desk operators will access the Ticketing System from their workstations, - Virtualized product under development Test and Analysis Environment for software products. - Company training environment that will be used to develop workforce knowledge and skills, - Provide computer resources for company management functions (e.g., Human Resources, Payroll, Legal, Contracts, project managers, personnel managers, company vice president, and company president). The rack also includes Cisco Catalyst Ethernet Switches that will interconnect the servers and SANS storage servers and a Cisco Meraki Layer 3 network switch will connect the server rack to any other server racks if they are installed in the future (not currently used). A patch panel is provided to allow for easier reconfiguration of the rack interconnect if it becomes necessary. An Uninterruptible Power Supply (UPS) will be included within the Server Rack that will provide temporary emergency power when the primary facility power circuit is interrupted allowing for a graceful shutdown or until any backup emergency power source is engaged. Files hardware.json and software.json provide the hardware and software list, respectively, for the Server Rack.",
      "bulk data storage rack": "The Bulk Data Storage Rack contains multiple Dell PowerVault Storage Area Network (SAN) units. This rack provides the archive storage the facility engineering and production, test engineering, IT and cybersecurity, and company management work areas. The IT cybersecurity data will be encrypted at rest on dedicated SANS drives. The company products technical data and test data assessed as sensitive Intellectual Property data and any other company sensitive data will be encrypted at rest and stored on dedicated SANS drives. The company also implements automatic archive replication to a backup SANS within the same equipment rack in the event of the primary archive failure. The SANS storage on the rack includes: - Provide the bulk data storage location for all data collected during IT operations and cybersecurity monitoring and cyber incident response, - Store product Intellectual Property and any other company sensitive data, such as financial records and contract agreements, - Store product test and analysis data and test reports, - Store company sensitive financial data, legal data to include contracts data, human resources data, payroll data, and any other company sensitive data. The Cisco Catalyst Layer 2 (Ethernet) switches interconnect the SAN components and connect to the Layer 3 switch (router) in the Boundary Defense and System Administration Rack. A patch panel will provide a central cable management point for all the internal equipment interconnection in the rack. It will also allow for easier reconfiguration of the rack interconnect if it becomes necessary. An Uninterruptible Power Supply (UPS) will be included within the Bulk Data Storage Rack that will provide temporary emergency power when the primary facility power circuit is interrupted allowing for a graceful shutdown of the equipment within the rack or until any backup emergency power source is engaged. Tables hardware.json and software.json provide the hardware and software list, respectively, for the Bulk Data Storage Rack.",
      "company workstations": "The company implements the common workstation configuration depicted in the file hardware.json for the engineering and production and company management work areas. Files hardware.json and software.json provide the company workstation hardware and software configuration, respectively.",
      "company laptops": "The test engineering work area uses the laptop configuration depicted in the file hardware.json. Laptops are used to allow for testing of the product items on the Test Lab table as well as on the production floor and in the field. The laptops will use a direct attached bulk storage tower when testing on the production floor or in the field. The collected test data will then be transferred onto the Test SANS once the laptops are reconnected to the company information system. The company does not have any kind of asset control process for the hard drives used within the direct attached bulk storage tower. Files hardware.json and software.json provide the test laptop hardware and software configuration, respectively."
    }
  }
]